; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c5-s3-p4-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 t5 t6 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 l3-0 l3-1 l3-2 l4-0 l4-1 l4-2 
          p0 p1 p2 p3 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-1)
    (at t3 l3-0)
    (at t4 l4-0)
    (at t5 l2-1)
    (at t6 l0-2)
    (at p0 l0-2)
    (at p1 l0-1)
    (at p2 l0-2)
    (at p3 l1-0)
    (at a0 l2-0)
    (at a1 l2-0)
    (at a2 l0-0)
)
(:goal
    (and
        (at p0 l0-2)
        (at p1 l1-0)
        (at p2 l1-1)
        (at p3 l0-1)
    )
)
)

; plan
1. (load-truck p2 t6 l0-2)
   deleted: (at p2 l0-2)
   added: (in p2 t6)
   goals met: 1 of 4
2. (drive-truck t6 l0-2 l0-1 c0)
   deleted: (at t6 l0-2)
   added: (at t6 l0-1)
   goals met: 1 of 4
3. (load-truck p1 t6 l0-1)
   deleted: (at p1 l0-1)
   added: (in p1 t6)
   goals met: 1 of 4
4. (drive-truck t6 l0-1 l0-0 c0)
   deleted: (at t6 l0-1)
   added: (at t6 l0-0)
   goals met: 1 of 4
5. (unload-truck p2 t6 l0-0)
   deleted: (in p2 t6)
   added: (at p2 l0-0)
   goals met: 1 of 4
6. (unload-truck p1 t6 l0-0)
   deleted: (in p1 t6)
   added: (at p1 l0-0)
   goals met: 1 of 4
7. (load-airplane p2 a2 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a2)
   goals met: 1 of 4
8. (load-airplane p1 a2 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 a2)
   goals met: 1 of 4
9. (fly-airplane a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 1 of 4
10. (load-airplane p3 a2 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a2)
   goals met: 1 of 4
11. (unload-airplane p1 a2 l1-0)
   deleted: (in p1 a2)
   added: (at p1 l1-0)
   goals met: 2 of 4
12. (unload-airplane p2 a2 l1-0)
   deleted: (in p2 a2)
   added: (at p2 l1-0)
   goals met: 2 of 4
13. (fly-airplane a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 2 of 4
14. (load-truck p2 t1 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 t1)
   goals met: 2 of 4
15. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 2 of 4
16. (unload-airplane p3 a2 l0-0)
   deleted: (in p3 a2)
   added: (at p3 l0-0)
   goals met: 2 of 4
17. (load-truck p3 t0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 2 of 4
18. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 2 of 4
19. (unload-truck p2 t1 l1-1)
   deleted: (in p2 t1)
   added: (at p2 l1-1)
   goals met: 3 of 4
20. (unload-truck p3 t0 l0-1)
   deleted: (in p3 t0)
   added: (at p3 l0-1)
   goals met: 4 of 4
